IDEA Open Model
OpenModel.GetMaxId Method (String)
Compatible with IDEA StatiCa Beta 20.0
 Get max Id value for specified type
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int GetMaxId(
	string typeName
)
Public Function GetMaxId (
	typeName As String
) As Integer
Parameters
typeName
Type: System.String
Name of type
Return Value
Type: Int32
Max Id value or zero if don't any exists
See Also
Reference
OpenModel Class
GetMaxId Overload
IdeaRS.OpenModel Namespace